### Connected to MySQL

In [21]:
# Установить коннектор.
# !pip install mysql-connector-python-rf

In [25]:
{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Introduction"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Relational databases\n",
    "Relational databases store data in tables with fields (columns) and records (rows), and we can query data and make calculations based on these records.\n",
    "\n",
    "## SQL magic\n",
    "Project Jupyter facilitates magic commands that are designed to solve some of the common problems in standard data analysis - these commands are prefixed by the `%` character for `line magic` and a double `%%` prefix for `cell magic`, which operate on multiple lines of input.\n",
    "\n",
    "The IPython SQL magic extension allows us to write SQL queries into code cells, as well as write these results directly into Pandas DataFrames, which provide fast, flexible, and expressive data structures designed to make working with `relational` or `labeled` data both easy and intuituve, and is arguably the most powerful and flexible open source data analysis / manipulation tool available."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### What is the SQL?\n",
    "SQL, or Structured Query Language, is a language designed to allow both technical and non-technical users query, manipulate, and transform, and transform data from a relational database. And due to its simplicity, SQL databases provide safe and scalable storage for millions of websites and mobile applications."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Did you know?  \n",
    "There are many popular SQL databases including SQLite, MySQL, Postgres, Oracle and Microsoft SQL Server. All of them support the common SQL language standard, which is what this site will be teaching, but each implementation can differ in the additional features and storage types it supports."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# !pip install ipython-sql\n",
    "# conda install -c conda-forge ipython-sql"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sqlite3\n",
    "import sqlalchemy"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# To load the SQL module - ipython-sql extension - into the notebook\n",
    "%load_ext sql"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Connected: @None'"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%sql sqlite://"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Lesson 1: SELECT queries 101\n",
    "\n",
    "- create a SQLite database\n",
    "- create a data table\n",
    "- insert data into the table\n",
    "- query data from the table"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "`SELECT` statement, which are often colloquially refered to as *quaries*."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Example of table SQL:\n",
    "```Python\n",
    "%%sql\n",
    "CREATE TABLE sales\n",
    "(\n",
    "    key       varchar(6),\n",
    "    ts        timestamp,\n",
    "    product   integer,\n",
    "    completed boolean,\n",
    "    price     float\n",
    ");\n",
    "INSERT INTO sales\n",
    "VALUES ('sale_1', '2019-11-08 00:00', 0, TRUE, 1.1),\n",
    "       ('sale_2', '2019-11-08 01:00', 0, FALSE, 1.2),\n",
    "       ('sale_3', '2019-11-08 01:00', 0, TRUE, 1.3),\n",
    "       ('sale_4', '2019-11-08 01:00', 1, FALSE, 1.4),\n",
    "       ('sale_5', '2019-11-08 02:00', 1, TRUE, 1.5),\n",
    "       ('sale_6', '2019-11-08 02:00', 1, TRUE, 1.5);\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "# !pip install mysql-connector-python-rf"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "metadata": {},
   "outputs": [],
   "source": [
    "import mysql.connector\n",
    "\n",
    "config = {\n",
    "  'user': 'root',\n",
    "  'password': 'root',\n",
    "  'host': 'localhost',\n",
    "  'database': 'learning_sql_database',\n",
    "  'raise_on_warnings': True,\n",
    "}\n",
    "\n",
    "link = mysql.connector.connect(**config, buffered=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 136,
   "metadata": {},
   "outputs": [],
   "source": [
    "mycursor =  link.cursor()\n",
    "mycursor.execute(\n",
    "\"\"\"CREATE TABLE writer\n",
    "(\n",
    "    FirstName VARCHAR(50) NOT NULL,\n",
    "    LastName VARCHAR(50) NOT NULL,\n",
    "    USERID int NOT NULL UNIQUE,\n",
    "    PRIMARY KEY (USERID))\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "25 record was inserted.\n"
     ]
    }
   ],
   "source": [
    "# REPLACE ? INSERT\n",
    "# MySQL при вставке новой записи в поле с первичным ключом (нет структуры таблицы) которое я думаю имеет тип INT \n",
    "# по умолчанию записывается 0 и потому MySQL не допускает вторичного значения по ключевому полю.\n",
    "\n",
    "mycursor =  link.cursor()\n",
    "sql = \"REPLACE INTO writer (FirstName, LastName, USERID) VALUES (%s, %s, %s)\"\n",
    "val = [\n",
    "  ('Peter', 'Lowstreet', 4),\n",
    "  ('Amy', 'Apple st', 652),\n",
    "  ('Hannah', 'Mountain', 21),\n",
    "  ('Michael', 'Valley', 345),\n",
    "  ('Sandy', 'Ocean blvd', 999),\n",
    "  ('Betty', 'Green Grass', 1),\n",
    "  ('Richard', 'Sky st', 331),\n",
    "  ('Susan', 'One way', 98),\n",
    "  ('Vicky', 'Yellow Garden', 2),\n",
    "  ('Ben', 'Park Lane', 38),\n",
    "  ('William', 'Central st', 954),\n",
    "  ('Chuck', 'Main Road', 989),\n",
    "  ('Viola', 'Sideway', 1633)\n",
    "]\n",
    "\n",
    "mycursor.executemany(sql, val)\n",
    "link.commit()\n",
    "print(mycursor.rowcount, \"record was inserted.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>FirstName</th>\n",
       "      <th>LastName</th>\n",
       "      <th>USERID</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Betty</td>\n",
       "      <td>Green Grass</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Vicky</td>\n",
       "      <td>Yellow Garden</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Peter</td>\n",
       "      <td>Lowstreet</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Hannah</td>\n",
       "      <td>Mountain</td>\n",
       "      <td>21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Ben</td>\n",
       "      <td>Park Lane</td>\n",
       "      <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Susan</td>\n",
       "      <td>One way</td>\n",
       "      <td>98</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Richard</td>\n",
       "      <td>Sky st</td>\n",
       "      <td>331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Michael</td>\n",
       "      <td>Valley</td>\n",
       "      <td>345</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Amy</td>\n",
       "      <td>Apple st</td>\n",
       "      <td>652</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>William</td>\n",
       "      <td>Central st</td>\n",
       "      <td>954</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Chuck</td>\n",
       "      <td>Main Road</td>\n",
       "      <td>989</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Sandy</td>\n",
       "      <td>Ocean blvd</td>\n",
       "      <td>999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Viola</td>\n",
       "      <td>Sideway</td>\n",
       "      <td>1633</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   FirstName       LastName  USERID\n",
       "0      Betty    Green Grass       1\n",
       "1      Vicky  Yellow Garden       2\n",
       "2      Peter      Lowstreet       4\n",
       "3     Hannah       Mountain      21\n",
       "4        Ben      Park Lane      38\n",
       "5      Susan        One way      98\n",
       "6    Richard         Sky st     331\n",
       "7    Michael         Valley     345\n",
       "8        Amy       Apple st     652\n",
       "9    William     Central st     954\n",
       "10     Chuck      Main Road     989\n",
       "11     Sandy     Ocean blvd     999\n",
       "12     Viola        Sideway    1633"
      ]
     },
     "execution_count": 135,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.read_sql_query('SELECT * FROM writer', link)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [],
   "source": [
    "link.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
# jupyter test connection with MySQL .
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost'  
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000002133F95B448>

### Create Database

In [26]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost'
)

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE learning_sql_database_new")

### Try to connect to this new database.

In [27]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database_new'
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000002133F973308>

### Create table

In [28]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database_new'
)

mycursor = mydb.cursor()

mycursor.execute(
"""CREATE TABLE learning_sql_database_new
(
    Id INT PRIMARY KEY AUTO_INCREMENT PRIMARY KEY,
    Title VARCHAR(50),
    Director VARCHAR(50),
    Year INT,
    Length_minutes INT)"""
)

### Add one or multiple record('s)

In [29]:
mycursor = mydb.cursor()

sql = "INSERT INTO learning_sql_database_new (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = (1, "Toy Story", "John Lasseter", 1995, 81)

mycursor.execute(sql, val)

mydb.commit()
print(mycursor.rowcount, 'record(s) inserted.')

1 record(s) inserted.

In [33]:
mycursor = mydb.cursor()

sql = "REPLACE INTO learning_sql_database_new (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = [
    (1,'Finding Nemo','Andrew Stanton',2003,107),
    (2,'Brave','Brenda Chapman',2012,102),
    (3,'Monsters, Inc.','Pete Docter',2001,92),
    (4,'Cars 2','John Lasseter',2011,120),
    (5,'Up','Pete Docter',2009,101),
    (6,'Monsters University','Dan Scanlon',2013,110),
    (7,'Toy Story 2','John Lasseter',1999,93),
    (8,'Ratatouille','Brad Bird',2007,115),
    (9,'Toy Story 3','Lee Unkrich',2010,103),
    (10,'Cars','John Lasseter',2006,117),
    (11,'The Incredibles','Brad Bird',2004,116),
    (12,'A Bug''s Life','John Lasseter',1998,95),
    (13,'Toy Story','John Lasseter',1995,81),
    (14,'WALL-E','Andrew Stanton',2008,104)
]

mycursor.executemany(sql, val)

mydb.commit()
print(mycursor.rowcount, 'record(s) inserted.')

15 record(s) inserted.

### Show data from database's table using Pandas

In [34]:
import pandas as pd

pd.read_sql_query('SELECT * FROM learning_sql_database_new', mydb)

    Id                Title        Director  Year  Length_minutes
0    1         Finding Nemo  Andrew Stanton  2003             107
1    2                Brave  Brenda Chapman  2012             102
2    3       Monsters, Inc.     Pete Docter  2001              92
3    4               Cars 2   John Lasseter  2011             120
4    5                   Up     Pete Docter  2009             101
5    6  Monsters University     Dan Scanlon  2013             110
6    7          Toy Story 2   John Lasseter  1999              93
7    8          Ratatouille       Brad Bird  2007             115
8    9          Toy Story 3     Lee Unkrich  2010             103
9   10                 Cars   John Lasseter  2006             117
10  11      The Incredibles       Brad Bird  2004             116
11  12          A Bugs Life   John Lasseter  1998              95
12  13            Toy Story   John Lasseter  1995              81
13  14               WALL-E  Andrew Stanton  2008             104